lvx/base/Catalogs/бит_КлючиСценарийЦФО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_КлючиСценарийЦФО</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаЗапретаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ГруппыЗапретаИзмененияДанныхБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/InformationRegisters/бит_АналитикаСценарийЦФО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_АналитикаСценарийЦФО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючАналитики</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_КлючиСценарийЦФО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/Catalogs/бит_КлючиСценарийЦФО/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Элементы.ДекорацияПредупреждение.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ЗначенияАналитик = Новый Структура("Сценарий, ЦФО");
	ЗаполнитьЗначенияСвойств(ЗначенияАналитик, Объект);
	
	МенеджерЗаписи = РегистрыСведений.бит_АналитикаСценарийЦФО.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ЗначенияАналитик);
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		Результат = МенеджерЗаписи.КлючАналитики;
		Если Результат <> Объект.Ссылка Тогда
			ТекстСообщения = НСтр("ru = 'Ключ с такими аналитиками уже существует: %1'; 
								  |en = 'The key with such Analytics already exists: %1'");
			
			ТекстСообщения = СтрШаблон(ТекстСообщения, Результат);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Результат, , ,Отказ); 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_АналитикаСценарийЦФО.КлючАналитики КАК КлючАналитики
	|ИЗ
	|	РегистрСведений.бит_АналитикаСценарийЦФО КАК бит_АналитикаСценарийЦФО
	|ГДЕ
	|	бит_АналитикаСценарийЦФО.КлючАналитики = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Ограничить 		 = НЕ РезультатЗапроса.Пустой();
	
	Элементы.Сценарий.ТолькоПросмотр 		   = Ограничить;
	Элементы.ЦФО.ТолькоПросмотр 			   = Ограничить;
	Элементы.ДекорацияПредупреждение.Видимость = Ограничить;
	
КонецПроцедуры

#КонецОбласти
